# CnvrtToGenericSolid

## Description
Converts Solid objects to generic solids. Removes solid history saving memory.

```pascal
FUNCTION CnvrtToGenericSolid(solid : HANDLE) : HANDLE;
```

```python

def vs.CnvrtToGenericSolid(solid):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|solid|HANDLE|object to convert|

## Version
Availability: from Vectorworks 2016
## Category
* Objects - Solids